Тест/Тест/src/AccumulationRegisters/РегистрАкция10/РегистрАкция10.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РегистрАкция10</name>
  <resources>
    <name>Колво</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаРек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест/Тест/src/CommonModules/ОперативныйУчетАкция10/Module.bsl
Функция СписокТоваровАкция10() ЭКСПОРТ
	//==================================================================================================================
	ТЗ_Товары = Новый ТаблицаЗначений(); 
	ТЗ_Фото	  = Новый ТаблицаЗначений(); 
	ТЗ_КодНоменкл = Новый Массив(); 
	МассивТоваров = Новый Массив();
	
	//==================================================================================================================
	ТЗ_Товары 	= СписокТоваров();
	ТЗ_КодНоменкл = ТЗ_Товары.ВыгрузитьКолонку("Код");
	ТЗ_Фото = РаботаССайтомWT.ПолучениеФотокарточек(ТЗ_КодНоменкл);
	
	//==================================================================================================================
	Для Каждого стр Из ТЗ_Товары Цикл
		
		Для Каждого Строка Из ТЗ_Фото Цикл
			Если Строка.id = стр.Код Тогда
				Структура = Новый Структура;
				Если Строка.images.main <> "" Тогда
					СтруктураТоваров = Новый Структура;
					СтруктураТоваров.Вставить("code"		,стр.Код );
					СтруктураТоваров.Вставить("photo"		,Строка.images.main);
					СтруктураТоваров.Вставить("name"		,стр.Товар);
					СтруктураТоваров.Вставить("article"		,стр.Артикул);
					СтруктураТоваров.Вставить("count"		,стр.КолвоОстаток);
					СтруктураТоваров.Вставить("price"		,стр.ЦенаРекОстаток / стр.КолвоОстаток);
					СтруктураТоваров.Вставить("salePrice"	,стр.ЦенаОстаток / стр.КолвоОстаток);
					МассивТоваров.Добавить(СтруктураТоваров);
					Прервать;
				Иначе
					Если Строка.images.common.Количество() > 0 Тогда
						СтруктураТоваров = Новый Структура;
						СтруктураТоваров.Вставить("code"		,стр.Код );
						СтруктураТоваров.Вставить("photo"		,Строка.images.common[0]);
						СтруктураТоваров.Вставить("name"		,стр.Товар);
						СтруктураТоваров.Вставить("article"		,стр.Артикул);
						СтруктураТоваров.Вставить("count"		,стр.КолвоОстаток);
						СтруктураТоваров.Вставить("price"		,стр.ЦенаРекОстаток / стр.КолвоОстаток);
						СтруктураТоваров.Вставить("salePrice"	,стр.ЦенаОстаток / стр.КолвоОстаток);
						МассивТоваров.Добавить(СтруктураТоваров);
						Прервать;	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивТоваров) Тогда 
		Возврат МассивТоваров; 
	Иначе 
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("status"	,404);
		МассивТоваров.Добавить(СтруктураТоваров);
		Возврат МассивТоваров; 
	КонецЕсли; 
	
	//==================================================================================================================
КонецФункции


Функция СписокТоваров() 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрАкция10Остатки.Товар.Наименование КАК Товар,
//		|	РегистрАкция10Остатки.индкод.Наименование КАК индкод,
//		|	РегистрАкция10Остатки.Склад.Наименование КАК Склад,
//		|	РегистрАкция10Остатки.машина.Наименование КАК машина,
		|	РегистрАкция10Остатки.КолвоОстаток КАК КолвоОстаток,
		|	РегистрАкция10Остатки.ЦенаОстаток КАК ЦенаОстаток,
		|	РегистрАкция10Остатки.Товар.Код КАК Код,
		|	РегистрАкция10Остатки.Товар.Артикул КАК Артикул,
		|	РегистрАкция10Остатки.ЦенаРекОстаток КАК ЦенаРекОстаток
		|ИЗ
		|	РегистрНакопления.РегистрАкция10.Остатки КАК РегистрАкция10Остатки
		|ГДЕ
		|	РегистрАкция10Остатки.КолвоОстаток > 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 

		ТЗ_Товары = РезультатЗапроса.Выгрузить(); 
		Возврат ТЗ_Товары; 
		
	КонецЕсли; 
КонецФункции	

Функция ПолучитьТоварыКарточкиАкция10(КодТовара) ЭКСПОРТ
	//==================================================================================================================
	ТЗ_Товары 		= Новый ТаблицаЗначений(); 
	ТЗ_Фото	  		= Новый ТаблицаЗначений(); 
	ТЗ_ИндКод		= Новый Массив(); 
	МассивТоваров 	= Новый Массив();
	
	//==================================================================================================================
	ТЗ_Товары 	= СписокТоваровКарточки(КодТовара);
	ТЗ_ИндКод 	= ТЗ_Товары.ВыгрузитьКолонку("индкод");
	ТЗ_Фото 	= РаботаССайтомWT.ПолучениеФотоБезИндНомер(ТЗ_ИндКод);
	
	//==================================================================================================================
	Для Каждого стр Из ТЗ_Товары Цикл
		
		Для Каждого Строка Из ТЗ_Фото Цикл
			Если Строка.indCode = стр.индкод Тогда
				Если Строка.urls.Количество() > 0 Тогда
					МассивФото = Новый Массив();
					Счетчик = 0; 
					Флаг = Ложь;
					Для Каждого СтрокаУрл ИЗ Строка.urls Цикл
						МассивФото.Добавить(СтрокаУрл);
						Счетчик = Счетчик + 1 ;
						Флаг = Истина; 
						Если Счетчик = 2 Тогда 
							Прервать;
						КонецЕсли; 
					КонецЦикла; 
					
					Если Флаг = Истина Тогда 
						СтруктураТоваров = Новый Структура;
						СтруктураТоваров.Вставить("name"	,стр.Товар);
						СтруктураТоваров.Вставить("article"	,стр.Артикул);
						СтруктураТоваров.Вставить("photo"	,МассивФото);
						СтруктураТоваров.Вставить("id"		,стр.индкод);
						СтруктураТоваров.Вставить("price"	,стр.ЦенаОстаток / стр.КолвоОстаток);
						МассивТоваров.Добавить(СтруктураТоваров);
						Прервать;
					КонецЕсли; 
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивТоваров) Тогда 
		Возврат МассивТоваров; 
	Иначе 
		
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("status"	,404);
		МассивТоваров.Добавить(СтруктураТоваров);
		Возврат МассивТоваров; 
		
	КонецЕсли; 
	
	//==================================================================================================================
КонецФункции

Функция СписокТоваровКарточки(КодТовара) 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрАкция10Остатки.Товар.Наименование КАК Товар,
		|	РегистрАкция10Остатки.индкод.Наименование КАК индкод,
//		|	РегистрАкция10Остатки.Склад.Наименование КАК Склад,
//		|	РегистрАкция10Остатки.машина.Наименование КАК машина,
		|	РегистрАкция10Остатки.КолвоОстаток КАК КолвоОстаток,
		|	РегистрАкция10Остатки.ЦенаОстаток КАК ЦенаОстаток,
		|	РегистрАкция10Остатки.Товар.Код КАК Код,
		|	РегистрАкция10Остатки.Товар.Артикул КАК Артикул,
		|	РегистрАкция10Остатки.ЦенаРекОстаток КАК ЦенаРекОстаток
		|ИЗ
		|	РегистрНакопления.РегистрАкция10.Остатки КАК РегистрАкция10Остатки
		|ГДЕ
		|	РегистрАкция10Остатки.КолвоОстаток > 0
		|	И РегистрАкция10Остатки.Товар.Код = &КодТовара";
	
	Запрос.УстановитьПараметр("КодТовара",КодТовара );
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 

		ТЗ_Товары = РезультатЗапроса.Выгрузить(); 
		Возврат ТЗ_Товары; 
		
	КонецЕсли; 
КонецФункции
